Revit 2027 API
CurveByPoints.IsReferenceLine Property
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsReferenceLine { get; set; }
Public Property IsReferenceLine As Boolean
	Get
	Set
public:
property bool IsReferenceLine {
	bool get ();
	void set (bool value);
}
member IsReferenceLine : bool with get, set
Property Value
Boolean
See Also
Reference
CurveByPoints Class
Autodesk.Revit.DB Namespace